# RbsDuctFittingLossMethodParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDuctFittingLossMethodParam Property
ParameterTypeId Class See Also
---
"Loss Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDuctFittingLossMethodParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDuctFittingLossMethodParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDuctFittingLossMethodParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace